Ran Apply for dir: `.` workspace: `production`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform apply -input=false -no-color" in "/home/ubuntu/.atlantis/repos/1995navinkumar/terraform/20/production": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/sknk/production/runs/run-eSQh2DoRMCMp2RvY

Waiting for 1 run(s) to finish before being queued...
Waiting for 1 run(s) to finish before being queued... (30s elapsed)
Waiting for 1 run(s) to finish before being queued... (1m0s elapsed)
Waiting for 1 run(s) to finish before being queued... (1m30s elapsed)
Waiting for 1 run(s) to finish before being queued... (2m0s elapsed)
Waiting for the plan to start... (2m30s elapsed)

Terraform v1.6.1
on linux_amd64
Initializing plugins and modules...
module.kubernetes.module.whoami.helm_release.whoami: Refreshing state... [id=whoami]
module.kubernetes.module.react-starter-vite.helm_release.react-starter-vite: Refreshing state... [id=react-starter-vite]
module.kubernetes.module.test-server.helm_release.test-server: Refreshing state... [id=test-server]
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-namespace: Refreshing state...
module.kubernetes.module.grafana.kubernetes_manifest.grafana-namespace: Refreshing state...
module.kubernetes.module.prometheus.helm_release.prometheus: Refreshing state... [id=prometheus]
module.kubernetes.module.grafana.helm_release.grafana: Refreshing state... [id=grafana]
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress-middleware: Refreshing state...
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kubernetes.module.grafana.helm_release.promtail will be created
  + resource "helm_release" "promtail" {
      + atomic                     = false
      + chart                      = "promtail"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "promtail"
      + namespace                  = "grafana"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                initContainer:
                  enabled: true
                  fsInotifyMaxUserInstances: 512
            EOT,
        ]
      + verify                     = false
      + version                    = "6.15.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.kubernetes.module.storage-class.kubernetes_manifest.db-storage will be created
  + resource "kubernetes_manifest" "db-storage" {
      + manifest = {
          + apiVersion        = "storage.k8s.io/v1"
          + kind              = "StorageClass"
          + metadata          = {
              + name = "db-storage"
            }
          + provisioner       = "k8s.io/minikube-hostpath"
          + reclaimPolicy     = "Delete"
          + volumeBindingMode = "Immediate"
        }
      + object   = {
          + allowVolumeExpansion = (known after apply)
          + allowedTopologies    = (known after apply)
          + apiVersion           = "storage.k8s.io/v1"
          + kind                 = "StorageClass"
          + metadata             = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "db-storage"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + mountOptions         = (known after apply)
          + parameters           = (known after apply)
          + provisioner          = "k8s.io/minikube-hostpath"
          + reclaimPolicy        = "Delete"
          + volumeBindingMode    = "Immediate"
        }
    }

  # module.kubernetes.module.storage-class.kubernetes_manifest.monitoring-storage will be created
  + resource "kubernetes_manifest" "monitoring-storage" {
      + manifest = {
          + apiVersion        = "storage.k8s.io/v1"
          + kind              = "StorageClass"
          + metadata          = {
              + name = "monitoring-storage"
            }
          + provisioner       = "k8s.io/minikube-hostpath"
          + reclaimPolicy     = "Delete"
          + volumeBindingMode = "Immediate"
        }
      + object   = {
          + allowVolumeExpansion = (known after apply)
          + allowedTopologies    = (known after apply)
          + apiVersion           = "storage.k8s.io/v1"
          + kind                 = "StorageClass"
          + metadata             = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "monitoring-storage"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + mountOptions         = (known after apply)
          + parameters           = (known after apply)
          + provisioner          = "k8s.io/minikube-hostpath"
          + reclaimPolicy        = "Delete"
          + volumeBindingMode    = "Immediate"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Error: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.

```
</details>